# Creating Series

In [53]:
# Program for creating Series using series() method of Pandas Library

In [54]:
#Import Pandas library
import pandas as pd

In [55]:
#Creating Student Name List
Name=["Vedant","Snehal","aadesh","Sanika","Ammar"]
Name

['Vedant', 'Snehal', 'aadesh', 'Sanika', 'Ammar']

In [56]:
#Creating a Series 
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1    Vedant
2    Snehal
3    aadesh
4    Sanika
5     Ammar
dtype: object

# Creating Data Frame

In [57]:
#Import Pandas library
import pandas as pd

In [58]:
#Creating Data Frame
df=pd.DataFrame([[10,12,14,16],[11,18,15,21],[12,13,14,15]],
columns= ["BI","DBMS","DSS","CAO"])

In [59]:
df

   BI  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15

In [60]:
df.shape

(3, 4)

In [61]:
df.size

12

In [62]:
df.ndim

2

# Adding Record (Row) to the data frame

In [63]:
df2=pd.DataFrame([[5,6,7,8]],
columns= ["CD","DBMS","DSS","CAO"])

In [64]:
df3=df.append(df2,ignore_index=True)

In [65]:
df3

     BI  DBMS  DSS  CAO   CD
0  10.0    12   14   16  NaN
1  11.0    18   15   21  NaN
2  12.0    13   14   15  NaN
3   NaN     6    7    8  5.0

# Adding Attribute (Columns) name DM

In [66]:
df3["DM"]=[12,15,16,14]

In [67]:

df3

     BI  DBMS  DSS  CAO   CD  DM
0  10.0    12   14   16  NaN  12
1  11.0    18   15   21  NaN  15
2  12.0    13   14   15  NaN  16
3   NaN     6    7    8  5.0  14

# Deleting Record from  df3 dataframe

In [68]:
df4=df3.drop(index=[1])

In [69]:
df4

     BI  DBMS  DSS  CAO   CD  DM
0  10.0    12   14   16  NaN  12
2  12.0    13   14   15  NaN  16
3   NaN     6    7    8  5.0  14

# Deleting Attribute (Columns) from df3 dataframe

In [70]:
df5=df3.drop(columns=["DM"])

In [71]:
df5

     BI  DBMS  DSS  CAO   CD
0  10.0    12   14   16  NaN
1  11.0    18   15   21  NaN
2  12.0    13   14   15  NaN
3   NaN     6    7    8  5.0

In [72]:
#Finding mean of DSS 

print("Mean of DSS:", df5["DSS"].mean())

Mean of DSS: 12.5

In [73]:
#Finding median of DSS

print("Median of DSS:", df5["DSS"].median())

Median of DSS: 14.0

In [74]:
#Finding mode of DSS

print("Mode of DSS:", df5["DSS"].mode())

Mode of DSS: 0    14
dtype: int64

In [75]:
#Finding max number of DSS

print("Max of DSS:", df5["DSS"].max())

Max of DSS: 15

In [76]:
#Finding Min number of DSS

print("Max of DSS:", df5["DSS"].min())

Max of DSS: 7